Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་སྲིན་བུ་པདྨ་ཀུན། །སོ་ནི་དཀར་པོར་སྐྱེས་གྱུར་ཏེ། །རྣོ་ཞིང་ཆེན་པོར་གྱུར་པ་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When all the leeches Grow teeth that are Long, white, and sharp, Then there will be a relic.

source: མཐོ་རིས་སུ་ནི་འཛེག་པའི་ཕྱིར། །ནམ་ཞིག་རི་བོང་རྭ་རྣམས་ལས། །སྐས་ནི་ལེགས་པར་བྱས་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a ladder is built From the horns of hares For climbing to the upper realms, Then there will be a relic.

source: ནམ་ཞིག་སྐས་ནི་དེར་འཛེགས་ཏེ། །བྱི་བས་ཟླ་བ་བཟའ་བ་དང་། །སྒྲ་གཅན་ལ་ཡང་གནོད་བྱེད་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a mouse climbs that ladder And then eats the moon And attacks Rāhu, Then there will be a relic.

source: གྲོང་ན་རྒྱུ་བའི་སྦྲང་བུ་ཡིས། །ནམ་ཞིག་རྫ་མའི་ཆང་འཐུངས་ཏེ། །ཁྱིམ་ན་གནས་པར་བྱེད་འགྱུར་བ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a village-dwelling fly Drinks a pitcher of beer And lives in a house, Then there will be a relic.

source: ནམ་ཞིག་བོང་བུ་བདེ་འགྱུར་ལ། །མཆུ་དམར་བིམ་པ་འདྲར་གྱུར་ཅིང་། །གླུ་གར་རྣམས་ལ་མཁས་གྱུར་པ། །
en: “When a happy donkey Has lips as red as a bimba fruit And is expert in song and dance, Then there will be a relic.

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་འུག་པ་བྱ་རོག་རྣམས། །དབེན་པར་དོང་ནས་རྩེ་བ་དང་། །ཕན་ཚུན་མཐུན་པར་གྱུར་པ་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When owls and crows Cavort together in private And live together in harmony, Then there will be a relic.

source: པ་ལ་ཤ་ཡི་ལོ་མ་རྣམས། །རིན་ཆེན་སྣ་གསུམ་གདུགས་གྱུར་ཏེ། །ཆར་འབབ་སྐྱབས་སུ་ནམ་གྱུར་པ། །
en: “When the leaves of the palash tree Become a parasol of three kinds of jewels And provide shelter from the falling rain, Then there will be a relic.

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་རྒྱ་མཚོའི་གྲུ་བོ་ཆེ། །འཁྲུལ་འཁོར་དང་ནི་གཡོར་མོར་བཅས། །ཐང་ལ་བྱུང་སྟེ་འགྲོ་བ་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a great oceangoing ship, With its instruments and sails, Comes onto and travels over dry land, Then there will be a relic.

source: ནམ་ཞིག་བྱ་ནི་འུག་པ་ཡིས། །རི་བོ་སྤོས་ཀྱི་ངད་ལྡང་བ། །མཆུ་ལ་ཐོགས་ཏེ་འགྲོ་འགྱུར་བ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When an owl picks up Gandhamādana Mountain In its beak and flies away, Then there will be a relic.”

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་ཚིགས་སུ་བཅད་པ་འདི་དག་ཐོས་ནས། ལིཙྪ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་སླར་སྨྲས་པ། ལེགས་སོ་ལེགས་སོ་གཞོན་ནུ་མཆོག །རྒྱལ་བའི་སྲས་པོ་ཚིག་པོ་ཆེ། །དཔའ་ཞིང་ཐབས་ལ་མཁས་ལྡན་པ། །
en: On hearing those verses, the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, replied to the Licchavī youth Sarva­sattva­priyadarśana with these verses: “Good!

source: ལུང་བསྟན་པ་ནི་དམ་པ་ཐོབ། །
en: Good!

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་པོ། །དེ་བཞིན་གཤེགས་པ་ཆེ་བ་ཉིད། །བསམ་གྱིས་མི་ཁྱབ་གོ་རིམས་བཞིན། །གཞོན་ནུ་བདག་ལས་མཉན་པར་གྱིས། །
en: Best of youths, Son of the jinas, with great words, Skilled in methods, heroic, Who has received the highest prophecy, “Young man, listen to me describe, In order the inconceivable Greatness of the world’s lord, The protector, the Tathāgata.

source: སངས་རྒྱས་ཡུལ་ནི་བསམ་མི་ཁྱབ། །
en: “The scope of the buddhas is inconceivable.

source: དེ་བཞིན་གཤེགས་རྣམས་མཚུངས་པ་མེད། །
en: The tathāgatas are without any equal.

source: སངས་རྒྱས་ཐམས་ཅད་རྟག་ཏུ་ཞི། །
en: All buddhas are always in peace.

source: སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་བྱུང་། །
en: All buddhas appear perfectly.

source: སངས་རྒྱས་ཐམས་ཅད་ཁ་དོག་མཚུངས། །འདི་ནི་སངས་རྒྱས་ཆོས་ཉིད་ཡིན། །
en: “All buddhas have the same color; That is the intrinsic nature of the buddhas.

source: བཅོམ་ལྡན་འདས་ནི་བཅོས་མ་མིན། །དེ་བཞིན་གཤེགས་པ་མ་སྐྱེས་ཏེ། །
en: The Bhagavat is not fabricated, And the Tathāgata is not produced.

source: རྡོ་རྗེ་ལྟ་བུར་སྲ་བའི་སྐུ། །
en: “He has a body like a vajra.

source: སྤྲུལ་པའི་སྐུ་ནི་སྟོན་པར་མཛད། །
en: He manifests an illusory body.

source: དྲང་སྲོང་ཆེན་པོའི་རིང་བསྲེལ་ནི། །ཡུངས་འབྲུ་ཙམ་ཞེས་བྱ་བ་མེད། །
en: The great Ṛṣi does not have relics, Not even of the size of a mustard seed.

source: སྐུ་ལ་རུས་པ་ཁྲག་མེད་ན། །རིང་བསྲེལ་ཡོད་པར་ག་ལ་འགྱུར། །
en: “How could there be relics From a body without bones or blood?

source: སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །ཐབས་ཀྱིས་རིང་བསྲེལ་བཞག་པར་མཛད། །
en: Relics are left through skillful methods In order to bring benefit to beings.

source: རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་སྐུ། །
en: “The perfect Buddha is a Dharma body.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས། །
en: The Tathāgata is a Dharma realm.

source: ཆོས་སྟོན་མཛད་པ་ཅི་འདྲ་བ། །བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་དེ་འདྲ། །
en: That is what the Bhagavat’s body is like. That is what teaching the Dharma is like.

source: བདག་གིས་འདི་ཐོས་ཤེས་ནས་ནི། །བདག་གིས་དམ་པ་གསོལ་བར་བྱས། །དེ་ཉིད་ཁོ་ན་ལུང་བསྟན་ཕྱིར། །
en: “I made that request for the sacred object, Having already heard and understood that.

source: གཏམ་གླེང་བ་ནི་བདག་གིས་བྱས། །
en: I spoke in that way In order to reveal the truth.”

source: དེ་ནས་ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་ཟབ་མོ་དེ་ལྟ་བུ་དེ་དག་ཐོས་ནས། ཐམས་ཅད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Then thirty-two thousand devas, having heard that profound teaching on the lifespan of the Tathāgata, all developed the aspiration for the highest, most complete enlightenment.

source: དེ་དག་ཡིད་ཀྱིས་ཀུན་ཏུ་རྟོག་པ་རབ་ཏུ་དགའ་ནས་སྒྲ་དབྱངས་གཅིག་ཏུ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །སངས་རྒྱས་མྱ་ངན་ཡོང་མི་འདའ། །
en: With joyful mental thoughts and with one voice, they recited these verses: “The Buddha does not pass away.

source: ཆོས་ཀྱང་ནུབ་པར་མི་འགྱུར་ཏེ། །
en: The Dharma does not disappear.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་མཛད་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདའ་བ་སྟོན། །
en: Passing into nirvāṇa is manifested In order to bring beings to maturity.

source: སངས་རྒྱས་བཅོམ་ལྡན་བསམ་མི་ཁྱབ། །དེ་བཞིན་གཤེགས་པ་རྟག་པའི་སྐུ། །
en: “The Bhagavat is inconceivable; The Tathāgata’s body is eternal.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་སྟོན། །
en: He demonstrates a variety of displays In order to bring benefit to beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ལས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་ཐོས་ནས། ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་དགའ་བ་དང་མགུ་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: Then the bodhisattva Ruciraketu, having heard the teaching on the lifespan of the Bhagavat Śākyamuni from both those buddha bhagavats and those excellent individuals, was filled with joy, delighted, elated, pleased, and happy—he was pervaded by great happiness and delight.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་འདི་བཤད་པའི་ཚེ། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ། །
en: When this teaching on the lifespan of the tathāgatas was taught, innumerable, countless beings developed the aspiration for the highest, most complete enlightenment, and those tathāgatas vanished.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་གཉིས་པའོ།། །།
en: This concludes “The Teaching on the Lifespan of the Tathāgata,” the second chapter of “The Lord King of Sūtras, The Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན། གསེར་གྱི་རྔ་ཀུན་ཏུ་སྣང་བ་འདི་ལྟ་སྟེ། ཉི་མའི་དཀྱིལ་འཁོར་འདྲ་བ་ཞིག་མཐོང་ངོ་། །
en: Chapter 3: The Dream The bodhisattva Ruciraketu then went to sleep and in a dream saw a golden drum that was shining brightly like the disk of the sun.

source: ཕྱོགས་ཐམས་ཅད་ན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་རིན་པོ་ཆེའི་ཤིང་དྲུང་ན། རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་ཁྲི་རྣམས་ལ་བཞུགས་ཤིང་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཏེ།
en: In all directions, there were countless, innumerable buddha bhagavats seated upon precious beryl thrones at the foot of precious trees, encircled by assemblies of many hundreds of thousands.

source: མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་པ་མཐོང་ངོ་། །
en: Looking straight ahead, they were teaching the Dharma.

source: དེ་ནས་ཡང་སྐྱེས་བུ་བྲམ་ཟེའི་གཟུགས་ལྟ་བུ་ཞིག་རྔ་དེ་རྡུང་བ་མཐོང་སྟེ། རྔའི་སྒྲ་དེ་ལས་བསྟན་པའི་ཚིགས་སུ་བཅད་པ་འདི་ལྟ་བུ་དག་བྱུང་བ་ཐོས་སོ། །
en: Then he saw a person who appeared to be a brahmin beating that drum, and he heard a teaching in verse come from the drumbeats.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གཉིད་སད་མ་ཐག་ཏུ། བསྟན་པའི་ཚིགས་སུ་བཅད་པ་དེ་དག་རྗེས་སུ་དྲན་ནོ། །
en: As soon as the bodhisattva Ruciraketu awoke from his sleep, he remembered the verses that were taught.

source: རྗེས་སུ་དྲན་ནས་ཀྱང་དེའི་མཚན་མོ་ཟད་པ་དང་། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་སྟེ། སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་བྱ་རྒོད་ཕུང་པོའི་རི་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Having remembered them, when the night was over, he left the city of Rājagṛha, and together with many thousands of people he went to Vulture Peak Mountain and into the presence of the Bhagavat.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: He bowed down to the feet of the Bhagavat and circumambulated the Bhagavat three times, keeping him to his right, and then sat down to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། རྨི་ལམ་ན་གང་རྔའི་སྒྲ་ལས་བསྟན་པའི་ཚིགས་སུ་བཅད་པ་ཐོས་པ་དེ་དག་གསོལ་ཏོ། །
en: Seated to one side, the bodhisattva Ruciraketu, with his palms together in homage, bowed toward the Bhagavat and recited the teaching in verse that he had heard from the sound of the drum in his dream.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། རྨི་ལམ་མཐོང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་གསུམ་པའོ།། །།
en: This concludes “The Dream,” the third chapter of “The Lord King of Sūtras, The Sublime Golden Light.”

source: ནུབ་གཅིག་གཡེལ་བ་མེད་པར་ཡང་། །བདག་གིས་རྨི་ལམ་རྨིས་པ་ནི། །
en: Chapter 4: The Confession “One night, though I was not Sleepy, I entered a dream.

source: མཛེས་པའི་རྔ་ཆེན་མཐོང་བ་སྟེ། །ཐམས་ཅད་དུ་ནི་གསེར་གྱི་འོད། །
en: I saw a large, beautiful drum Entirely of golden light.

source: ཉི་མ་ཇི་ལྟ་བཞིན་དུ་འབར། །ཀུན་ཏུ་རྣམ་པར་ལྷང་ངེ་སྟེ། །ཕྱོགས་བཅུ་རྣམས་སུ་སྣང་བར་གྱུར། །
en: “It was shining like the sun And completely bright, Illuminating the ten directions.

source: ཀུན་ཏུ་རིན་ཆེན་ཤིང་དྲུང་ན། །རིན་ཆེན་བཻ་ཌཱུརྱ་དག་གི། །ཁྲི་ལ་སངས་རྒྱས་རྣམས་བཞུགས་ཏེ། །བརྒྱ་སྟོང་ཕྲག་ནི་དུ་མ་ཡི། །འཁོར་དབུས་མདུན་གྱིས་བལྟས་པ་མཐོང་། །
en: I saw buddhas everywhere, “Seated beneath precious trees On precious beryl thrones, Looking straight ahead in the middle Of many hundreds of thousands of followers.

source: བྲམ་ཟེའི་གཟུགས་ནི་འདྲ་བ་ཞིག །རྔ་ཆེན་རབ་ཏུ་བརྡུང་བ་མཐོང་། །དེ་ཡིས་དེ་ལ་བརྡུངས་པ་དང་། །
en: “I saw someone resembling a brahmin Who beat that big drum.

source: ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་། །གསེར་འོད་དམ་པའི་རྔ་ཆེན་སྒྲ་ཡིས་ནི། །སྟོང་གསུམ་འཇིག་རྟེན་འཇིག་རྟེན་གསུམ་འདི་ན། །ངན་སོང་སྡུག་བསྔལ་གཤིན་རྗེའི་སྡུག་བསྔལ་དང་། །དབུལ་བའི་སྡུག་བསྔལ་མ་ལུས་ཞི་བར་ཤོག །
en: As he was beating it, There came these verses: “ ‘Through the sound of the great drum of sublime golden light, May all the suffering of the lower existences, The suffering in Yama’s realm, and the suffering of poverty Cease in the three realms within this trichiliocosm.

source: རྔ་བོ་ཆེ་ཡི་སྒྲ་སྐད་འདི་ཡིས་ནི། །འཇིག་རྟེན་རྨོངས་པ་ཐམས་ཅད་ཞི་གྱུར་ཅིག །ཇི་ལྟར་ཐུབ་དབང་འཇིགས་མེད་འཇིགས་ཞི་ལྟར། །སེམས་ཅན་འཇིགས་མེད་འཇིགས་དང་བྲལ་བར་ཤོག །
en: “ ‘Through the sound and words of the great drum, May all the ignorance in the world cease; Just as the lord of sages is without fear and his fear has ceased, So may all beings be without fear and have their fears cease.

source: ཇི་ལྟར་འཁོར་བར་ཀུན་མཁྱེན་ཐུབ་དབང་པོ། །འཕགས་པའི་ཡོན་ཏན་ཀུན་དང་ལྡན་པ་ལྟར། །སྐྱེ་དགུ་ཏིང་འཛིན་བྱང་ཆུབ་ཡན་ལག་གི། །ཡོན་ཏན་ལྡན་ཞིང་ཡོན་ཏན་རྒྱ་མཚོར་གྱུར། །
en: “ ‘Just like the omniscient lord of sages in saṃsāra Possesses all the qualities of the āryas, In that way, may beings become oceans of qualities, Possessing the qualities of the aspects of enlightenment.

source: རྔ་བོ་ཆེ་ཡི་སྒྲ་སྐད་འདི་ཡིས་ནི། །སེམས་ཅན་ཐམས་ཅད་ཚངས་པའི་དབྱངས་ལྡན་གྱུར། །སངས་རྒྱས་བྱང་ཆུབ་དམ་པ་མཆོག་རེག་ཤོག །ཆོས་ཀྱི་འཁོར་ལོ་དགེ་བ་བསྐོར་གྱུར་ཅིག །
en: “ ‘Through the sound and words of the great drum, May all beings possess the voice of Brahmā And reach the supreme enlightenment of Sublime buddhahood and turn the good Dharma wheel.

source: བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་བཞུགས་པར་ཤོག །
en: “ ‘May they remain for countless eons.

source: འགྲོ་ལ་ཕན་ཕྱིར་ཆོས་ཀྱང་སྟོན་གྱུར་ཅིག །
en: May they teach the Dharma to benefit beings.

source: ཉོན་མོངས་འཇོམས་གྱུར་སྡུག་བསྔལ་སེལ་བར་ཤོག །
en: May they defeat the kleśas and dispel suffering.

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཞི་གྱུར་ཅིག །
en: May desire, anger, and ignorance cease.

source: སེམས་ཅན་གང་དག་ངན་སོང་སར་གནས་ཏེ། །རུས་པའི་ལུས་ལ་མེ་ལྕེ་རབ་འབར་བ། །དེ་དག་རྔ་ཆེན་བསྒྲགས་པ་ཐོས་གྱུར་ཅིག །སངས་རྒྱས་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་ཐོས་ཤོག །
en: “ ‘Those beings who are in the lower realms, Whose skeleton bodies are burning in fire, May they hear the sound of the great drum And hear the words, “Homage to the buddhas!”

source: སེམས་ཅན་ཀུན་གྱིས་ཚེ་རབས་བརྒྱ་དག་དང་། །སྐྱེ་བ་སྟོང་ཕྲག་བྱེ་བར་སྐྱེ་དྲན་ཤོག །
en: “ ‘May all beings remember hundreds of lifetimes— Thousands of millions of lifetimes.

source: ཐུབ་པའི་དབང་པོ་རྟག་ཏུ་དྲན་གྱུར་ཅིང་། །དེ་དག་གི་ནི་རྒྱ་ཆེན་གསུང་ཐོས་ཤོག །
en: May they always remember the Munīndra, And may they hear his vast teaching.

source: རྔ་བོ་ཆེ་ཡི་སྒྲ་སྐད་འདི་ཡིས་ནི། །སངས་རྒྱས་རྣམས་དང་རྟག་ཏུ་འགྲོགས་རྙེད་གྱུར། །སྡིག་པའི་ལས་རྣམས་རྣམ་པར་སྤོང་བར་ཤོག །
en: “ ‘Through the sound and words of the great drum, May they always be together with buddhas And completely forsake bad actions.

source: བྱ་བ་དགེ་བ་རྣམས་ནི་སྤྱོད་གྱུར་ཅིག །
en: May they accomplish good actions.

source: མི་དང་ལྷ་དང་སྲོག་ཆགས་ཐམས་ཅད་ཀྱིས། །དེ་དག་བསམ་དང་སྨོན་ལམ་གང་ཡིན་པ། །རྔ་བོ་ཆེ་ཡི་སྒྲ་སྐད་འདི་ཡིས་ནི། །དེ་དག་རྣམས་ཀྱི་དེ་ཀུན་རྫོགས་གྱུར་ཅིག །
en: “ ‘May the sound of the great drum Completely bring to fulfillment Whatever wishes and prayers are made By humans, devas, and all beings.

source: སེམས་ཅན་གང་དག་སེམས་དམྱལ་མི་བཟད་སྐྱེས། །ལུས་ལ་མེ་ལྕེ་ཀུན་ཏུ་རབ་ཏུ་འབར། །སྐྱབས་མེད་མྱ་ངན་བཅས་ཤིང་ཡོངས་འཁྱམ་པ། །མེ་རྣམས་དེ་དག་རབ་ཏུ་ཞི་བར་ཤོག །
en: “ ‘May the fires be extinguished For the beings born in the terrible hells, Where their bodies burn completely in fire, And they wander in anguish without a savior.

source: སེམས་དམྱལ་ཡི་དགས་མི་ཡི་འཇིག་རྟེན་ན། །སེམས་ཅན་སྡུག་བསྔལ་མི་བཟད་དྲག་པོ་གང་། །རྔ་བོ་ཆེ་ཡི་སྒྲ་སྐད་འདི་ཡིས་ནི། །དེ་དག་རྣམས་ཀྱི་སྡུག་བསྔལ་ཀུན་ཞི་ཤོག །
en: “ ‘May the sound of the great drum Bring an end to the sufferings of those beings Who are experiencing intense, unendurable suffering In the hells, among the pretas, and in the human world.

source: རྟེན་མེད་དཔུང་གཉེན་མེད་པ་དང་། །སྐྱབས་མེད་པར་ཡང་གྱུར་པ་དག །དེ་རྣམས་ལ་ནི་སྐྱོབ་པ་དང་། །དཔུང་གཉེན་རྟེན་མཆོག་བདག་གྱུར་ཅིག །
en: “ ‘For those who have no support, No protection, and no refuge, May there be protection and support, And may there be the supreme refuge.

source: སངས་རྒྱས་རྐང་གཉིས་དམ་པ་དག །ཐུགས་བརྩེ་ཐུགས་རྗེ་ལྡན་པའི་ཐུགས། །གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། །བཞུགས་པ་བདག་ལ་དགོངས་སུ་གསོལ། །
en: “ ‘The buddhas, the supreme among two-legged beings, Who have minds of love and compassion, Who are in the worlds in the ten directions, I pray that you turn your regard upon me.

source: བདག་གིས་སྔོན་ཅད་སྡིག་པའི་ལས། །ཤིན་ཏུ་མི་བཟད་གང་བགྱིས་པ། །སྟོབས་བཅུའི་སྤྱན་སྔར་བདག་མཆིས་ཏེ། །དེ་དག་ཐམས་ཅད་བཤགས་པར་བགྱི། །ཕ་མ་དག་ཏུ་མི་འཛིན་དང་། །སངས་རྒྱས་རྣམས་སུ་མི་འཛིན་དང་། །དགེ་བ་དག་ཏུ་མི་འཛིན་པས། །སྡིག་པ་བདག་གིས་གང་བགྱིས་པ། །ཕྱུག་པའི་རྒྱགས་པས་དྲེགས་པ་དང་། །རིགས་དང་ལོངས་སྤྱོད་རྒྱགས་པ་དང་། །བཞོན་པའི་རྒྱགས་པས་དྲེགས་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །ཉེས་བསམས་ཉེས་པར་སྨྲས་པ་དང་། །ཉེས་པར་བགྱིས་པའི་ལས་རྣམས་དང་། །ཉེས་པའི་དམིགས་སུ་མ་བལྟས་པས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །བྱིས་པའི་བློ་ཡི་འཇུག་པ་དང་། །མི་ཤེས་མུན་པའི་སེམས་དང་ནི། །སྡིག་པའི་གྲོགས་པོའི་དབང་གྱུར་དང་། །ཉོན་མོངས་རྣམ་པར་འཁྲུག་སེམས་དང་། །རྩེད་མོ་དགའ་བའི་དབང་ཉིད་དང་། །མྱ་ངན་དང་ནི་ནད་དབང་དང་། །ནོར་གྱིས་མི་ཆོག་ཉེས་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །འཕགས་མིན་སྐྱེ་བོ་འདྲེ་བ་དང་། །ཕྲག་དོག་སེར་སྣའི་རྒྱུ་དང་ནི། །གཡོ་དང་དབུལ་བའི་ཉེས་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །ཕོངས་པ་བྱུང་བའི་དུས་ཀྱི་ཚེ། །འདོད་པ་རྣམས་ཀྱི་འཇིགས་རྒྱུ་དང་། །ཕྱུག་པོ་མ་ཡིན་གྱུར་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །གཡོ་བའི་སེམས་ཀྱིས་དབང་ཉིད་དང་། །
en: “ ‘The extremely dreadful bad actions That I have carried out in the past, I confess all of them in the presence Of those who have the ten strengths.

source: འདོད་དང་ཁྲོ་བའི་དབང་དག་དང་། །བཀྲེས་དང་སྐོམ་གྱིས་ཉེན་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །བཟའ་བ་དག་དང་བཏུང་བ་དང་། །བུད་མེད་རྒྱུ་དང་གོས་ཀྱི་ཕྱིར། །ཉོན་མོངས་གདུང་བ་སྣ་ཚོགས་ཀྱིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །ལུས་དང་ངག་དང་ཡིད་ཀྱི་སྡིག །ཉེས་པར་སྤྱད་པ་རྣམ་གསུམ་བསགས། །
en: “ ‘Whatever bad actions I have done, Such as ignoring my mother and father, Not acknowledging the buddhas, And not acknowledging good actions; “ ‘Whatever bad actions I have done, Such as being arrogant with pride in my wealth, And arrogant with pride in my family, My possessions, and my youth; “ ‘Whatever bad thoughts, bad words, And harmful actions I have produced; Whatever bad actions I have done, Not viewing them as being harmful; “ ‘Whatever bad actions I have done Through foolishness of mind, My mind being darkened by ignorance, Or being under the influence of bad friends, “ ‘Or through my mind being disturbed by kleśas, Because of delighting in amusements, Or through being in misery, being ill, Or through the evil of dissatisfaction with wealth; “ ‘Whatever bad actions I have done Because of associating with ignoble beings, Or caused by my jealousy and miserliness, Or by my dishonesty and neediness; “ ‘Whatever bad actions I have done During the times when I was in misfortune, Or through fears concerning my desires, Or when I was parted from my wealth; “ ‘Whatever bad actions I have done Under the power of a deceitful mind, Under the power of desire and anger, Or because of hunger and thirst; “ ‘Whatever bad actions I have done For the sake of food and drink, For the sake of women and clothes, Or from being tormented by various kleśas— “ ‘The bad actions of body, speech, and mind, My accumulation of those three kinds of bad conduct, Whatever I have done of that kind, I make a confession of it all.

source: འདི་འདྲའི་ཚུལ་གྱིས་གང་བགྱིས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །སངས་རྒྱས་རྣམས་དང་ཆོས་རྣམས་དང་། །དེ་བཞིན་ཉན་ཐོས་རྣམས་ལ་ཡང་། །གུས་པ་མ་ལགས་གང་བགྱིས་པ། །
en: “ ‘I make a confession of all Disrespect I have shown To the buddhas, the Dharma, And likewise to the śrāvakas.

source: དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །གང་ཡང་རང་སངས་རྒྱས་རྣམས་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡང་། །གུས་པ་མ་ལགས་བགྱིས་པ་རྣམས། །
en: “ ‘I make a confession of all Disrespect I have shown To pratyekabuddhas And to bodhisattvas.

source: དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །དམ་ཆོས་སྨྲ་བ་རྣམས་ལ་ཡང་། །གུས་པ་མ་ལགས་བགྱིས་པ་དང་། །ཆོས་ལའང་གུས་པར་མ་བགྱིས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I make a confession of all Disrespect I have shown To teachers of the Dharma and Disrespect I have shown to the Dharma itself.

source: བདག་གིས་རྟག་ཏུ་མི་ཤེས་པས། །དམ་པའི་ཆོས་ནི་སྤངས་པ་དང་། །ཕ་མ་རྣམས་ལ་མ་གུས་དང་། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I make a confession of all My rejection of the Dharma And disrespect to my parents Through being in constant ignorance.

source: བླུན་པ་དང་ནི་བྱིས་པ་དང་། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དང་། །ང་རྒྱལ་དྲེགས་པས་བསྒྲིབས་བགྱིས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I make a confession of all Obscuration through stupidity and foolishness; Through desire, anger, and ignorance; And through pride and arrogance.

source: བདག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ། །སྟོབས་བཅུ་རྣམས་ལ་མཆོད་པར་བགྱི། །
en: “ ‘I will make offerings to those with the ten strengths In the worlds in the ten directions.

source: བདག་གིས་ཕྱོགས་བཅུར་སེམས་ཅན་རྣམས། །སྡུག་བསྔལ་ཀུན་ལས་འདོན་པར་བགྱི། །
en: I will save from all suffering The beings in the ten directions.

source: སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་ཀུན། །ས་བཅུ་ལ་ནི་དགོད་པར་བགྱི། །
en: “ ‘I will bring all the Countless beings onto the ten bhūmis.

source: ས་བཅུ་ལ་ནི་གནས་ནས་ཀྱང་། །ཐམས་ཅད་དེ་བཞིན་གཤེགས་གྱུར་ཅིག །
en: When they have reached the ten bhūmis, May they all become tathāgatas.

source: ཇི་སྲིད་སྡུག་བསྔལ་རྒྱ་མཚོ་ལས། །དེ་ཀུན་ཐར་བགྱི་ནུས་སྲིད་དུ། །སེམས་ཅན་རེ་རེའི་ཕྱིར་ཡང་ནི། །བསྐལ་པ་བྱེ་བར་སྤྱད་པར་བགྱི། །
en: “ ‘Until I can free them all From the ocean of suffering, For millions of eons I will be active For the sake of every single being.

source: གསེར་འོད་དམ་པ་ཞེས་བགྱི་བ། །ལས་རྣམས་ཐམས་ཅད་བྱང་བགྱིད་པ། །ཟབ་མོ་དག་ནི་སྟོན་པ་ནི། །སེམས་ཅན་དེ་དག་བསྟན་པར་བགྱི། །
en: “ ‘I will teach those beings This profound teaching That is called The Sublime Golden Light And purifies one of all karma.

source: གང་གིས་བསྐལ་པ་སྟོང་རྣམས་སུ། །སྡིག་པ་ཤིན་ཏུ་མི་བཟད་བགྱིས། །ལན་ཅིག་རབ་ཏུ་བཤགས་པ་ཡིས། །དེ་དག་ཐམས་ཅད་བྱང་བར་འགྱུར། །
en: “ ‘Those who have committed dreadful evil acts Throughout a thousand eons Will purify themselves of them Through one single confession.

source: གང་གིས་ལས་ཀྱི་སྒྲིབ་པ་རྣམས། །མྱུར་དུ་ཡང་དག་ཟད་འགྱུར་བ། །གསེར་འོད་དམ་པ་དགེ་བ་ཡིས། །བཤགས་པ་འདི་དག་བཤགས་ནས་ནི། །
en: “ ‘Those who are obscured by bad karma Will quickly become purified of it Through confessing with these confessions Through the good Sublime Golden Light.

source: རིན་ཆེན་འབྱུང་གནས་མཆོག་བཅུ་པོ། །ས་བཅུ་ལ་ནི་གནས་པར་བགྱི། །
en: “ ‘I will dwell upon the ten bhūmis, The supreme ten that are the source of jewels.

source: སངས་རྒྱས་ཡོན་ཏན་སྣང་བར་བགྱི། །སྲིད་པའི་མཚོ་ལས་བསྒྲལ་བར་བགྱི། །
en: I will cause the qualities of a buddha to appear And liberate others from the ocean of existence.

source: སངས་རྒྱས་རྒྱ་མཚོ་ཆུ་བོ་དང་། །ཡོན་ཏན་རྒྱ་མཚོ་ཟབ་མོ་དང་། །སངས་རྒྱས་ཡོན་ཏན་བསམ་ཡས་ཀྱིས། །ཐམས་ཅད་མཁྱེན་དུ་རྫོགས་པར་བགྱི། །
en: “ ‘Through the inconceivable qualities of a buddha, The flow of the ocean of buddhahood, And the deep ocean of buddha qualities, I will have the perfection of omniscience.

source: ཏིང་འཛིན་བརྒྱ་ཕྲག་སྟོང་རྣམས་དང་། །གཟུངས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་དང་། །དབང་སྟོབས་བྱང་ཆུབ་ཡན་ལག་གི། །སྟོབས་བཅུ་དམ་པར་འགྱུར་བར་བགྱི། །
en: “ ‘Through a hundred thousand samādhis, Through countless powers of mental retention, And through the strengths, powers, and aspects of enlightenment, I will become a sublime one with the ten strengths.

source: དགོངས་པའི་ཐུགས་ཀྱིས་སངས་རྒྱས་རྣམས། །བདག་ལ་རྣམ་པར་གཟིགས་སུ་གསོལ། །
en: “ ‘I pray that the buddhas look upon me And regard me with their minds.

source: ཐུགས་རྗེ་ལྡན་པའི་ཐུགས་ཀྱིས་ནི། །ནོངས་པར་རབ་ཏུ་གཟུང་དུ་གསོལ། །
en: I pray that with their minds of great compassion They apprehend the errors I have made.

source: བདག་གིས་བསྐལ་པ་བརྒྱ་རྣམས་སུ། །སྔོན་ཆད་སྡིག་པ་གང་བགྱིས་པ། །དེ་ཕྱིར་བདག་ནི་མྱ་ངན་སེམས། །ཕོངས་དང་མྱ་ངན་འཇིགས་པས་གཟིར། །
en: “ ‘I am tormented by a sorrowful mind, By wretchedness, by misery, and by terror Concerning the bad actions I have done In the past, throughout a hundred eons.

source: སྡིག་པའི་ལས་ལ་འཇིགས་པར་བགྱིད། །
en: “ ‘I am terrified of my bad actions.

source: ཡིད་ནི་རྟག་ཏུ་དམན་པར་འགྱུར། །
en: My mind is always low.

source: གང་དང་གང་དུ་སྤྱོད་བགྱིད་པ། །བདག་ནི་གང་དུའང་དགའ་མ་མཆིས། །
en: Whatever I do, I find no happiness.

source: སངས་རྒྱས་ཐམས་ཅད་ཐུགས་རྗེ་ལྡན། །འགྲོ་བ་ཀུན་གྱི་འཇིགས་སེལ་བས། །
en: “ ‘All the compassionate buddhas Dispel the fear of all beings.

source: ནོངས་པར་རབ་ཏུ་གཟུང་དུ་གསོལ། །འཇིགས་པ་དག་ལས་བདག་ཐར་མཛོད། །
en: I pray that you apprehend my faults And free me from fear.

source: བདག་གི་ཉོན་མོངས་ལས་རྣམས་ཀྱི། །དྲི་མ་དེ་བཞིན་གཤེགས་པས་ཤོལ། །
en: “ ‘May the tathāgatas remove The stain of my kleśas and karma.

source: སངས་རྒྱས་རྣམས་ཀྱིས་བདག་ལ་ནི། །སྙིང་རྗེའི་ཆུ་ཡིས་བཀྲུ་བར་གསོལ། །
en: I pray that the buddhas wash me With the water of their compassion.

source: སྡིག་པ་ཐམས་ཅད་བཤགས་པར་བགྱི། །སྔོན་ཆད་བདག་གིས་གང་བགྱིས་དང་། །ད་ལྟར་བདག་གི་སྡིག་པ་གང་། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I confess all my bad actions; Those that I have done in the past And those that are my present bad actions, I make a confession of them all.

source: ནོངས་པར་བགྱིས་པའི་ལས་རྣམས་ཀུན། །སླན་ཆད་མི་བགྱིད་བསྡམ་པར་བགྱི། །བདག་གིས་ནོངས་པར་བགྱིས་པ་གང་། །
en: “ ‘I make the commitment that I will not do again All the wrong actions that I have done.
